<?xml version="1.0" ?>
<net name="yolov8n" version="10">
	<layers>
		<layer id="0" name="images" type="Parameter" version="opset1">
			<data shape="1, 3, 352, 640" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>352</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="images/scale_copy" type="Const" version="opset1">
			<data element_type="f16" shape="16, 3, 3, 3" offset="0" size="864"/>
			<output>
				<port id="0" precision="FP16" names="model.0.conv.weight">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>352</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>176</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Conv_0/Dims3761" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="864" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>176</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="128">
					<dim>1</dim>
					<dim>16</dim>
					<dim>176</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Mul_2" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>176</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="130">
					<dim>1</dim>
					<dim>16</dim>
					<dim>176</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="model.1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 16, 3, 3" offset="896" size="9216"/>
			<output>
				<port id="0" precision="FP16" names="model.1.conv.weight">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Conv_3/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>176</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv_3/Dims3605" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="10112" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Conv_3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="131">
					<dim>1</dim>
					<dim>32</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Mul_5" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="133">
					<dim>1</dim>
					<dim>32</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="model.2.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 1, 1" offset="10176" size="2048"/>
			<output>
				<port id="0" precision="FP16" names="model.2.cv1.conv.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Conv_6/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_6/Dims3479" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="12224" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="134">
					<dim>1</dim>
					<dim>32</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Mul_8" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="136">
					<dim>1</dim>
					<dim>32</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Split_9/VariadicSplit_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="12288" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="17" name="Split_9/VariadicSplit_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="12296" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Split_9/VariadicSplit" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16" names="137">
					<dim>1</dim>
					<dim>16</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
				<port id="4" precision="FP16" names="138">
					<dim>1</dim>
					<dim>16</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="model.2.m.0.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="16, 16, 3, 3" offset="12312" size="4608"/>
			<output>
				<port id="0" precision="FP16" names="model.2.m.0.cv1.conv.weight">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Conv_10/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Conv_10/Dims3545" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="16920" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv_10" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="139">
					<dim>1</dim>
					<dim>16</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Mul_12" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="141">
					<dim>1</dim>
					<dim>16</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="model.2.m.0.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="16, 16, 3, 3" offset="16952" size="4608"/>
			<output>
				<port id="0" precision="FP16" names="model.2.m.0.cv2.conv.weight">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Conv_13/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Conv_13/Dims3449" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="21560" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Conv_13" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="142">
					<dim>1</dim>
					<dim>16</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Mul_15" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="144">
					<dim>1</dim>
					<dim>16</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Add_16" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="145">
					<dim>1</dim>
					<dim>16</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Concat_17" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16" names="146">
					<dim>1</dim>
					<dim>48</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="model.2.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 48, 1, 1" offset="21592" size="3072"/>
			<output>
				<port id="0" precision="FP16" names="model.2.cv2.conv.weight">
					<dim>32</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Conv_18/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Conv_18/Dims3755" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="24664" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv_18" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="147">
					<dim>1</dim>
					<dim>32</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Mul_20" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="149">
					<dim>1</dim>
					<dim>32</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="model.3.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="64, 32, 3, 3" offset="24728" size="36864"/>
			<output>
				<port id="0" precision="FP16" names="model.3.conv.weight">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Conv_21/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>88</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Conv_21/Dims3701" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="61592" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_21" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="150">
					<dim>1</dim>
					<dim>64</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Mul_23" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="152">
					<dim>1</dim>
					<dim>64</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="model.4.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 1, 1" offset="61720" size="8192"/>
			<output>
				<port id="0" precision="FP16" names="model.4.cv1.conv.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Conv_24/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Conv_24/Dims3725" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="69912" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv_24" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="153">
					<dim>1</dim>
					<dim>64</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Mul_26" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="155">
					<dim>1</dim>
					<dim>64</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Split_27/VariadicSplit_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="12288" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="47" name="Split_27/VariadicSplit_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="70040" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Split_27/VariadicSplit" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16" names="156">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
				<port id="4" precision="FP16" names="157">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="model.4.m.0.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 3, 3" offset="70056" size="18432"/>
			<output>
				<port id="0" precision="FP16" names="model.4.m.0.cv1.conv.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_28/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_28/Dims3539" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="88488" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv_28" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="158">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Mul_30" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="160">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="model.4.m.0.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 3, 3" offset="88552" size="18432"/>
			<output>
				<port id="0" precision="FP16" names="model.4.m.0.cv2.conv.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_31/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_31/Dims3551" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="106984" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv_31" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="161">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Mul_33" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="163">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Add_34" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="164">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="model.4.m.1.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 3, 3" offset="107048" size="18432"/>
			<output>
				<port id="0" precision="FP16" names="model.4.m.1.cv1.conv.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_35/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv_35/Dims3635" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="125480" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Conv_35" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="165">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Mul_37" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="167">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="model.4.m.1.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 3, 3" offset="125544" size="18432"/>
			<output>
				<port id="0" precision="FP16" names="model.4.m.1.cv2.conv.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv_38/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Conv_38/Dims3617" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="143976" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Conv_38" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="168">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Mul_40" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="170">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Add_41" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="171">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Concat_42" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16" names="172">
					<dim>1</dim>
					<dim>128</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="model.4.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="64, 128, 1, 1" offset="144040" size="16384"/>
			<output>
				<port id="0" precision="FP16" names="model.4.cv2.conv.weight">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_43/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_43/Dims3797" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="160424" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_43" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="173">
					<dim>1</dim>
					<dim>64</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Mul_45" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="175">
					<dim>1</dim>
					<dim>64</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="model.5.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="128, 64, 3, 3" offset="160552" size="147456"/>
			<output>
				<port id="0" precision="FP16" names="model.5.conv.weight">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Conv_46/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>44</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_46/Dims3785" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="308008" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_46" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="176">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Mul_48" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="178">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="model.6.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 1, 1" offset="308264" size="32768"/>
			<output>
				<port id="0" precision="FP16" names="model.6.cv1.conv.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Conv_49/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Conv_49/Dims3767" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="341032" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_49" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="179">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Mul_51" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="181">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Split_52/VariadicSplit_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="12288" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="88" name="Split_52/VariadicSplit_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="341288" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Split_52/VariadicSplit" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16" names="182">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
				<port id="4" precision="FP16" names="183">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="model.6.m.0.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="341304" size="73728"/>
			<output>
				<port id="0" precision="FP16" names="model.6.m.0.cv1.conv.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_53/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Conv_53/Dims3467" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="415032" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Conv_53" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="184">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Mul_55" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="186">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="model.6.m.0.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="415160" size="73728"/>
			<output>
				<port id="0" precision="FP16" names="model.6.m.0.cv2.conv.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv_56/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Conv_56/Dims3581" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="488888" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv_56" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="187">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Mul_58" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="189">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Add_59" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="190">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="model.6.m.1.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="489016" size="73728"/>
			<output>
				<port id="0" precision="FP16" names="model.6.m.1.cv1.conv.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv_60/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_60/Dims3575" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="562744" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Conv_60" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="191">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Mul_62" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="193">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="model.6.m.1.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="562872" size="73728"/>
			<output>
				<port id="0" precision="FP16" names="model.6.m.1.cv2.conv.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_63/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv_63/Dims3653" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="636600" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_63" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="194">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Mul_65" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="196">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Add_66" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="197">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Concat_67" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16" names="198">
					<dim>1</dim>
					<dim>256</dim>
					<dim>22</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="model.6.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="128, 256, 1, 1" offset="636728" size="65536"/>
			<output>
				<port id="0" precision="FP16" names="model.6.cv2.conv.weight">
