<?xml version="1.0" ?>
<net name="yolov7" version="10">
	<layers>
		<layer id="0" name="images" type="Parameter" version="opset1">
			<data shape="1, 3, 416, 416" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="images/scale_copy" type="Const" version="opset1">
			<data element_type="f16" shape="32, 3, 3, 3" offset="0" size="1728"/>
			<output>
				<port id="0" precision="FP16" names="model.0.conv.weight">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Conv_0/Dims3854" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="1728" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="187">
					<dim>1</dim>
					<dim>32</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Mul_2" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="189">
					<dim>1</dim>
					<dim>32</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="model.1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="64, 32, 3, 3" offset="1792" size="36864"/>
			<output>
				<port id="0" precision="FP16" names="model.1.conv.weight">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Conv_3/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv_3/Dims4058" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="38656" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Conv_3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="190">
					<dim>1</dim>
					<dim>64</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Mul_5" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="192">
					<dim>1</dim>
					<dim>64</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="model.2.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="38784" size="73728"/>
			<output>
				<port id="0" precision="FP16" names="model.2.conv.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Conv_6/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_6/Dims4232" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="112512" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="193">
					<dim>1</dim>
					<dim>64</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Mul_8" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="195">
					<dim>1</dim>
					<dim>64</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="model.3.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="128, 64, 3, 3" offset="112640" size="147456"/>
			<output>
				<port id="0" precision="FP16" names="model.3.conv.weight">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Conv_9/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Conv_9/Dims4100" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="260096" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_9" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="196">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Mul_11" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="198">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="model.5.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="64, 128, 1, 1" offset="260352" size="16384"/>
			<output>
				<port id="0" precision="FP16" names="model.5.conv.weight">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv_15/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_15/Dims3884" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="276736" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Conv_15" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="202">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Mul_17" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="204">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="model.6.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="276864" size="73728"/>
			<output>
				<port id="0" precision="FP16" names="model.6.conv.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Conv_18/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_18/Dims4118" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="350592" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_18" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="205">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Mul_20" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="207">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="model.7.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="350720" size="73728"/>
			<output>
				<port id="0" precision="FP16" names="model.7.conv.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Conv_21/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Conv_21/Dims4286" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="424448" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv_21" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="208">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Mul_23" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="210">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="model.8.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="424576" size="73728"/>
			<output>
				<port id="0" precision="FP16" names="model.8.conv.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Conv_24/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Conv_24/Dims3914" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="498304" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_24" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="211">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Mul_26" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="213">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="model.9.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="498432" size="73728"/>
			<output>
				<port id="0" precision="FP16" names="model.9.conv.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Conv_27/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Conv_27/Dims4160" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="572160" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv_27" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="214">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Mul_29" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="216">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="model.4.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="64, 128, 1, 1" offset="572288" size="16384"/>
			<output>
				<port id="0" precision="FP16" names="model.4.conv.weight">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Conv_12/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Conv_12/Dims3956" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="588672" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_12" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="199">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Mul_14" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="201">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Concat_30" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16" names="217">
					<dim>1</dim>
					<dim>256</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="model.11.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 1, 1" offset="588800" size="131072"/>
			<output>
				<port id="0" precision="FP16" names="model.11.conv.weight">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv_31/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Conv_31/Dims3866" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="719872" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_31" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="218">
					<dim>1</dim>
					<dim>256</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Mul_33" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="220">
					<dim>1</dim>
					<dim>256</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="model.14.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="128, 256, 1, 1" offset="720384" size="65536"/>
			<output>
				<port id="0" precision="FP16" names="model.14.conv.weight">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv_38/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv_38/Dims4154" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="785920" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Conv_38" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="225">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Mul_40" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="227">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="model.15.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 3, 3" offset="786176" size="294912"/>
			<output>
				<port id="0" precision="FP16" names="model.15.conv.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Conv_41/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Conv_41/Dims4274" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="1081088" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Conv_41" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="228">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Mul_43" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="230">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="MaxPool_34" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="221">
					<dim>1</dim>
					<dim>256</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="model.13.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="128, 256, 1, 1" offset="1081344" size="65536"/>
			<output>
				<port id="0" precision="FP16" names="model.13.conv.weight">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv_35/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Conv_35/Dims3950" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="1146880" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Conv_35" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="222">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Mul_37" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="224">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Concat_44" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="231">
					<dim>1</dim>
					<dim>256</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="model.18.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="128, 256, 1, 1" offset="1147136" size="65536"/>
			<output>
				<port id="0" precision="FP16" names="model.18.conv.weight">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_48/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Conv_48/Dims3938" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="1212672" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Conv_48" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="235">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Mul_50" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="237">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="model.19.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 3, 3" offset="1212928" size="294912"/>
			<output>
				<port id="0" precision="FP16" names="model.19.conv.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_51/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_51/Dims4256" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="1507840" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Conv_51" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="238">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Mul_53" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="240">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="model.20.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 3, 3" offset="1508096" size="294912"/>
			<output>
				<port id="0" precision="FP16" names="model.20.conv.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_54/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_54/Dims3806" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="1803008" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv_54" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="241">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Mul_56" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="243">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="model.21.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 3, 3" offset="1803264" size="294912"/>
			<output>
				<port id="0" precision="FP16" names="model.21.conv.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv_57/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_57/Dims4004" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="2098176" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Conv_57" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="244">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Mul_59" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="246">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="model.22.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 3, 3" offset="2098432" size="294912"/>
			<output>
				<port id="0" precision="FP16" names="model.22.conv.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Conv_60/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv_60/Dims4022" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="2393344" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Conv_60" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="247">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Mul_62" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="249">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="model.17.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="128, 256, 1, 1" offset="2393600" size="65536"/>
			<output>
				<port id="0" precision="FP16" names="model.17.conv.weight">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_45/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Conv_45/Dims4148" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="2459136" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv_45" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="232">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Mul_47" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="234">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Concat_63" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16" names="250">
					<dim>1</dim>
					<dim>512</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="model.24.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="512, 512, 1, 1" offset="2459392" size="524288"/>
			<output>
				<port id="0" precision="FP16" names="model.24.conv.weight">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Conv_64/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_64/Dims4202" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512, 1, 1" offset="2983680" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv_64" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="251">
					<dim>1</dim>
					<dim>512</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Mul_66" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="253">
					<dim>1</dim>
					<dim>512</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="model.66.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="128, 512, 1, 1" offset="2984704" size="131072"/>
			<output>
				<port id="0" precision="FP16" names="model.66.conv.weight">
					<dim>128</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_195/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_195/Dims4250" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="3115776" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_195" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
