<?xml version="1.0" ?>
<net name="palm_detection_192x192" version="11">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data shape="1,3,192,192" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input_1, input_1/Transpose([0 3 1 2])"/>
				<attribute name="old_api_map_element_type" version="0" value="f16"/>
				<attribute name="old_api_map_order" version="0" value="0, 2, 3, 1"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="input_1:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C,H,W]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="input_1/scale_copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 3, 5, 5" offset="0" size="4800"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input_1/scale_copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="input_1/scale_copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="Conv2D/filter:0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Conv2D:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="model_1/model/batch_normalization/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d/Conv2D1/y_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="4800" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="model_1/model/batch_normalization/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d/Conv2D1/y" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="model_1/model/batch_normalization/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d/Conv2D1/y"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/model/batch_normalization/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d/Conv2D1/y:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="model_1/model/batch_normalization/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/batch_normalization/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d/Conv2D1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/model/batch_normalization/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d/Conv2D1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/Neg/mul__compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="4864" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/Neg/mul_" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/Neg/mul_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/Neg:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="571_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="4928" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="571" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="571"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/Neg_1/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/Neg_1/mul_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/Neg_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/Relu_1" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/Relu_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/Relu_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/mul"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/mul:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize:0,model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/add:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="depthwise/filter_in_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 5, 5" offset="4930" size="1600"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="depthwise/filter_in" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="depthwise/filter_in"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="depthwise/filter_in:0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="depthwise, model_1/model/depthwise_conv2d/depthwise1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise:0,model_1/model/depthwise_conv2d/depthwise1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv2D_1/filter_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 1, 1" offset="6530" size="2048"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Conv2D_1/filter" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="Conv2D_1/filter"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="Conv2D_1/filter:0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Conv2D_1" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Conv2D_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Conv2D_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_1/Conv2D1/y_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="8578" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_1/Conv2D1/y" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_1/Conv2D1/y"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_1/Conv2D1/y:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_1/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_1/Conv2D1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_1/Conv2D1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="model_1/model/add/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/add/add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/model/add/add:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/Neg/mul__compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="8642" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/Neg/mul_" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/Neg/mul_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/Neg:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="555_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="4928" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="555" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="555"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/Neg_1/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/Neg_1/mul_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/Neg_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/Relu_1" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/Relu_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/Relu_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/mul"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/mul:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize:0,model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/add:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="depthwise_1/filter_in_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 5, 5" offset="8706" size="1600"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="depthwise_1/filter_in" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="depthwise_1/filter_in"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="depthwise_1/filter_in:0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="depthwise_1" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="depthwise_1, model_1/model/depthwise_conv2d_1/depthwise1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_1:0,model_1/model/depthwise_conv2d_1/depthwise1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Conv2D_2/filter_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 1, 1" offset="10306" size="2048"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv2D_2/filter" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="Conv2D_2/filter"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="Conv2D_2/filter:0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv2D_2" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Conv2D_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Conv2D_2:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_2/Conv2D1/y_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="12354" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_2/Conv2D1/y" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_2/Conv2D1/y"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_2/Conv2D1/y:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_2/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_2/Conv2D1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_2/Conv2D1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="model_1/model/add_1/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/add_1/add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/model/add_1/add:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/Neg/mul__compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="12418" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/Neg/mul_" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/Neg/mul_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/Neg:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="505_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="4928" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="505" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="505"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/Neg_1/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/Neg_1/mul_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/Neg_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/Relu_1" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/Relu_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/Relu_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/mul"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/mul:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize:0,model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/add:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="depthwise_2/filter_in_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 5, 5" offset="12482" size="1600"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="depthwise_2/filter_in" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="depthwise_2/filter_in"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="depthwise_2/filter_in:0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="depthwise_2" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="depthwise_2, model_1/model/depthwise_conv2d_2/depthwise1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_2:0,model_1/model/depthwise_conv2d_2/depthwise1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv2D_3/filter_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 1, 1" offset="14082" size="2048"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv2D_3/filter" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="Conv2D_3/filter"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="Conv2D_3/filter:0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv2D_3" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Conv2D_3"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Conv2D_3:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="model_1/model/batch_normalization_3/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_3/Conv2D1/y_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="16130" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="model_1/model/batch_normalization_3/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_3/Conv2D1/y" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="model_1/model/batch_normalization_3/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_3/Conv2D1/y"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/model/batch_normalization_3/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_3/Conv2D1/y:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="model_1/model/batch_normalization_3/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_3/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/batch_normalization_3/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_3/Conv2D1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/model/batch_normalization_3/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_3/Conv2D1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="model_1/model/add_2/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/add_2/add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/model/add_2/add:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="model_1/model/p_re_lu_3/add_model_1/model/p_re_lu_3/Relu_model_1/model/p_re_lu_3/Neg_1_model_1/model/p_re_lu_3/Relu_1_model_1/model/p_re_lu_3/mul_dequantize_prelu/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="model_1/model/p_re_lu_3/add_model_1/model/p_re_lu_3/Relu_model_1/model/p_re_lu_3/Neg_1_model_1/model/p_re_lu_3/Relu_1_model_1/model/p_re_lu_3/mul_dequantize_prelu/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/model/p_re_lu_3/add_model_1/model/p_re_lu_3/Relu_model_1/model/p_re_lu_3/Neg_1_model_1/model/p_re_lu_3/Relu_1_model_1/model/p_re_lu_3/mul_dequantize_prelu/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="model_1/model/p_re_lu_3/add_model_1/model/p_re_lu_3/Relu_model_1/model/p_re_lu_3/Neg_1_model_1/model/p_re_lu_3/Relu_1_model_1/model/p_re_lu_3/mul_dequantize_prelu/Neg/mul__compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="16194" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="model_1/model/p_re_lu_3/add_model_1/model/p_re_lu_3/Relu_model_1/model/p_re_lu_3/Neg_1_model_1/model/p_re_lu_3/Relu_1_model_1/model/p_re_lu_3/mul_dequantize_prelu/Neg/mul_" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="model_1/model/p_re_lu_3/add_model_1/model/p_re_lu_3/Relu_model_1/model/p_re_lu_3/Neg_1_model_1/model/p_re_lu_3/Relu_1_model_1/model/p_re_lu_3/mul_dequantize_prelu/Neg/mul_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/model/p_re_lu_3/add_model_1/model/p_re_lu_3/Relu_model_1/model/p_re_lu_3/Neg_1_model_1/model/p_re_lu_3/Relu_1_model_1/model/p_re_lu_3/mul_dequantize_prelu/Neg:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="539_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="4928" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="539" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="539"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
