<?xml version="1.0" ?>
<net name="depth_estimation_mbnv2_480x640" version="10">
	<layers>
		<layer id="0" name="input.1" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 3, 480, 640"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input.1/scale_copy" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="32, 3, 3, 3" size="1728"/>
			<output>
				<port id="0" names="709" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Conv_0/Dims3995" type="Const" version="opset1">
			<data element_type="f16" offset="1728" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="708" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Clip_3" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" names="347" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="712" type="Const" version="opset1">
			<data element_type="f16" offset="1792" shape="32, 1, 1, 3, 3" size="576"/>
			<output>
				<port id="0" names="712" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Conv_4/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv_4/Dims3977" type="Const" version="opset1">
			<data element_type="f16" offset="2368" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Conv_4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="711" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Clip_7" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" names="352" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="715" type="Const" version="opset1">
			<data element_type="f16" offset="2432" shape="16, 32, 1, 1" size="1024"/>
			<output>
				<port id="0" names="715" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Conv_8/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_8/Dims3899" type="Const" version="opset1">
			<data element_type="f16" offset="3456" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="714" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="718" type="Const" version="opset1">
			<data element_type="f16" offset="3488" shape="96, 16, 1, 1" size="3072"/>
			<output>
				<port id="0" names="718" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Conv_9/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Conv_9/Dims4205" type="Const" version="opset1">
			<data element_type="f16" offset="6560" shape="1, 96, 1, 1" size="192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Conv_9" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="717" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Clip_12" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" names="359" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="721" type="Const" version="opset1">
			<data element_type="f16" offset="6752" shape="96, 1, 1, 3, 3" size="1728"/>
			<output>
				<port id="0" names="721" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Conv_13/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv_13/Dims4103" type="Const" version="opset1">
			<data element_type="f16" offset="8480" shape="1, 96, 1, 1" size="192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_13" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="720" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Clip_16" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="364" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="724" type="Const" version="opset1">
			<data element_type="f16" offset="8672" shape="24, 96, 1, 1" size="4608"/>
			<output>
				<port id="0" names="724" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Conv_17/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Conv_17/Dims4091" type="Const" version="opset1">
			<data element_type="f16" offset="13280" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_17" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="723" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="727" type="Const" version="opset1">
			<data element_type="f16" offset="13328" shape="144, 24, 1, 1" size="6912"/>
			<output>
				<port id="0" names="727" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_18/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Conv_18/Dims4169" type="Const" version="opset1">
			<data element_type="f16" offset="20240" shape="1, 144, 1, 1" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Conv_18" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="726" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Clip_21" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="371" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="730" type="Const" version="opset1">
			<data element_type="f16" offset="20528" shape="144, 1, 1, 3, 3" size="2592"/>
			<output>
				<port id="0" names="730" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv_22/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Conv_22/Dims4097" type="Const" version="opset1">
			<data element_type="f16" offset="23120" shape="1, 144, 1, 1" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Conv_22" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="729" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Clip_25" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="376" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="733" type="Const" version="opset1">
			<data element_type="f16" offset="23408" shape="24, 144, 1, 1" size="6912"/>
			<output>
				<port id="0" names="733" precision="FP16">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv_26/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_26/Dims3929" type="Const" version="opset1">
			<data element_type="f16" offset="30320" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Conv_26" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="732" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Add_27" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" names="379" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="736" type="Const" version="opset1">
			<data element_type="f16" offset="30368" shape="144, 24, 1, 1" size="6912"/>
			<output>
				<port id="0" names="736" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv_28/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv_28/Dims4175" type="Const" version="opset1">
			<data element_type="f16" offset="37280" shape="1, 144, 1, 1" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Conv_28" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="735" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Clip_31" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="384" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="739" type="Const" version="opset1">
			<data element_type="f16" offset="37568" shape="144, 1, 1, 3, 3" size="2592"/>
			<output>
				<port id="0" names="739" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_32/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_32/Dims3947" type="Const" version="opset1">
			<data element_type="f16" offset="40160" shape="1, 144, 1, 1" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv_32" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="738" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Clip_35" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="389" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="742" type="Const" version="opset1">
			<data element_type="f16" offset="40448" shape="32, 144, 1, 1" size="9216"/>
			<output>
				<port id="0" names="742" precision="FP16">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_36/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_36/Dims4121" type="Const" version="opset1">
			<data element_type="f16" offset="49664" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv_36" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="741" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="745" type="Const" version="opset1">
			<data element_type="f16" offset="49728" shape="192, 32, 1, 1" size="12288"/>
			<output>
				<port id="0" names="745" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv_37/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Conv_37/Dims3887" type="Const" version="opset1">
			<data element_type="f16" offset="62016" shape="1, 192, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_37" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="744" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Clip_40" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="396" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="748" type="Const" version="opset1">
			<data element_type="f16" offset="62400" shape="192, 1, 1, 3, 3" size="3456"/>
			<output>
				<port id="0" names="748" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Conv_41/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Conv_41/Dims4025" type="Const" version="opset1">
			<data element_type="f16" offset="65856" shape="1, 192, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv_41" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="747" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Clip_44" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="401" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="751" type="Const" version="opset1">
			<data element_type="f16" offset="66240" shape="32, 192, 1, 1" size="12288"/>
			<output>
				<port id="0" names="751" precision="FP16">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv_45/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Conv_45/Dims3851" type="Const" version="opset1">
			<data element_type="f16" offset="78528" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Conv_45" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="750" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Add_46" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" names="404" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="754" type="Const" version="opset1">
			<data element_type="f16" offset="78592" shape="192, 32, 1, 1" size="12288"/>
			<output>
				<port id="0" names="754" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_47/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_47/Dims3953" type="Const" version="opset1">
			<data element_type="f16" offset="90880" shape="1, 192, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Conv_47" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="753" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Clip_50" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="409" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="757" type="Const" version="opset1">
			<data element_type="f16" offset="91264" shape="192, 1, 1, 3, 3" size="3456"/>
			<output>
				<port id="0" names="757" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_51/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_51/Dims4235" type="Const" version="opset1">
			<data element_type="f16" offset="94720" shape="1, 192, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_51" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="756" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Clip_54" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="414" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="760" type="Const" version="opset1">
			<data element_type="f16" offset="95104" shape="32, 192, 1, 1" size="12288"/>
			<output>
				<port id="0" names="760" precision="FP16">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Conv_55/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_55/Dims4037" type="Const" version="opset1">
			<data element_type="f16" offset="107392" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_55" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="759" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Add_56" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" names="417" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="763" type="Const" version="opset1">
			<data element_type="f16" offset="107456" shape="192, 32, 1, 1" size="12288"/>
			<output>
				<port id="0" names="763" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_57/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv_57/Dims4013" type="Const" version="opset1">
			<data element_type="f16" offset="119744" shape="1, 192, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_57" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="762" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Clip_60" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="422" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="766" type="Const" version="opset1">
			<data element_type="f16" offset="120128" shape="192, 1, 1, 3, 3" size="3456"/>
			<output>
				<port id="0" names="766" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Conv_61/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Conv_61/Dims4073" type="Const" version="opset1">
			<data element_type="f16" offset="123584" shape="1, 192, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv_61" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="765" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Clip_64" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="427" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="769" type="Const" version="opset1">
			<data element_type="f16" offset="123968" shape="64, 192, 1, 1" size="24576"/>
			<output>
				<port id="0" names="769" precision="FP16">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Conv_65/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_65/Dims4049" type="Const" version="opset1">
			<data element_type="f16" offset="148544" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Conv_65" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="768" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="772" type="Const" version="opset1">
			<data element_type="f16" offset="148672" shape="384, 64, 1, 1" size="49152"/>
			<output>
				<port id="0" names="772" precision="FP16">
					<dim>384</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_66/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>384</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Conv_66/Dims4199" type="Const" version="opset1">
			<data element_type="f16" offset="197824" shape="1, 384, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv_66" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="771" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Clip_69" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="434" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="775" type="Const" version="opset1">
			<data element_type="f16" offset="198592" shape="384, 1, 1, 3, 3" size="6912"/>
			<output>
				<port id="0" names="775" precision="FP16">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv_70/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_70/Dims4007" type="Const" version="opset1">
			<data element_type="f16" offset="205504" shape="1, 384, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_70" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="774" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Clip_73" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="439" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="778" type="Const" version="opset1">
			<data element_type="f16" offset="206272" shape="64, 384, 1, 1" size="49152"/>
			<output>
				<port id="0" names="778" precision="FP16">
					<dim>64</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_74/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
