<?xml version="1.0" ?>
<net name="sbd_mask" version="10">
	<layers>
		<layer id="0" name="229" type="Const" version="opset1">
			<data offset="0" size="5120" shape="2,1280" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="229">
					<dim>2</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_add_78747879" type="Const" version="opset1">
			<data offset="5120" size="2560" shape="1,1280,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="data_add_78667871" type="Const" version="opset1">
			<data offset="7680" size="640" shape="1,320,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="334/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="8320" size="614400" shape="320,960,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="217">
					<dim>320</dim>
					<dim>960</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="data_add_78587863" type="Const" version="opset1">
			<data offset="622720" size="1920" shape="1,960,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>960</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="data_add_78507855" type="Const" version="opset1">
			<data offset="624640" size="1920" shape="1,960,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>960</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="data_add_78187823" type="Const" version="opset1">
			<data offset="626560" size="320" shape="1,160,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="317/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="626880" size="184320" shape="160,576,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="181">
					<dim>160</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="data_add_78107815" type="Const" version="opset1">
			<data offset="811200" size="1152" shape="1,576,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="data_add_78027807" type="Const" version="opset1">
			<data offset="812352" size="1152" shape="1,576,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="data_add_77707775" type="Const" version="opset1">
			<data offset="813504" size="192" shape="1,96,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="300/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="813696" size="73728" shape="96,384,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="145">
					<dim>96</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="data_add_77627767" type="Const" version="opset1">
			<data offset="887424" size="768" shape="1,384,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="data_add_77547759" type="Const" version="opset1">
			<data offset="888192" size="768" shape="1,384,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="data_add_77227727" type="Const" version="opset1">
			<data offset="888960" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="283/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="889088" size="24576" shape="64,192,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="109">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="data_add_77147719" type="Const" version="opset1">
			<data offset="913664" size="384" shape="1,192,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="data_add_77067711" type="Const" version="opset1">
			<data offset="914048" size="384" shape="1,192,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="data_add_76747679" type="Const" version="opset1">
			<data offset="914432" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="266/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="914496" size="9216" shape="32,144,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="73">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="data_add_76667671" type="Const" version="opset1">
			<data offset="923712" size="288" shape="1,144,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="data_add_76587663" type="Const" version="opset1">
			<data offset="924000" size="288" shape="1,144,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="data_add_76267631" type="Const" version="opset1">
			<data offset="924288" size="48" shape="1,24,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="249/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="924336" size="4608" shape="24,96,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="37">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="data_add_76187623" type="Const" version="opset1">
			<data offset="928944" size="192" shape="1,96,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="data_add_76107615" type="Const" version="opset1">
			<data offset="929136" size="192" shape="1,96,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="data_add_76027607" type="Const" version="opset1">
			<data offset="929328" size="32" shape="1,16,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="241/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="929360" size="1024" shape="16,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="19">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="data_add_75947599" type="Const" version="opset1">
			<data offset="930384" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="data_add_75867591" type="Const" version="opset1">
			<data offset="930448" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="235/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="930512" size="2048" shape="32,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="7">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="data_add_7583" type="Const" version="opset1">
			<data offset="932560" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="0" type="Parameter" version="opset1">
			<data shape="1,3,224,224" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="0/scale_copy" type="Const" version="opset1">
			<data offset="932624" size="1728" shape="32,3,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="231" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="232/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="232">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="233" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="233">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="234" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="235/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="235">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="236" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="236">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="238/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="934352" size="576" shape="32,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="13">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="237" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="238/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="238">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="239" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="239">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="240" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="241/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="241">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="243/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="934928" size="3072" shape="96,16,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="25">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="242" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="243/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="243">
					<dim>1</dim>
					<dim>96</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="244" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="244">
					<dim>1</dim>
					<dim>96</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="246/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="938000" size="1728" shape="96,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="31">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="245" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="246/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="246">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="247" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="247">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="248" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="249/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="249">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="data_add_76507655" type="Const" version="opset1">
			<data offset="939728" size="48" shape="1,24,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="257/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="939776" size="6912" shape="24,144,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="55">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="data_add_76427647" type="Const" version="opset1">
			<data offset="946688" size="288" shape="1,144,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="data_add_76347639" type="Const" version="opset1">
			<data offset="946976" size="288" shape="1,144,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="251/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="947264" size="6912" shape="144,24,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="43">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="250" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="251/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="251">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="252" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="252">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="254/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="954176" size="2592" shape="144,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="49">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="253" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="254/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="254">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="255" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="255">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="256" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="257/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="257">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="258" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="258">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="260/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="956768" size="6912" shape="144,24,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="61">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="259" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="260/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="260">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="261" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="261">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="263/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="963680" size="2592" shape="144,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="67">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="262" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="263/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="263">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="264" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="264">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="265" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="266/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="266">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="data_add_76987703" type="Const" version="opset1">
			<data offset="966272" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="274/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="966336" size="12288" shape="32,192,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="91">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="data_add_76907695" type="Const" version="opset1">
			<data offset="978624" size="384" shape="1,192,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="data_add_76827687" type="Const" version="opset1">
			<data offset="979008" size="384" shape="1,192,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="268/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="979392" size="12288" shape="192,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="79">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="267" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="268/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="268">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="269" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="269">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="271/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="991680" size="3456" shape="192,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="85">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="270" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="271/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="271">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="272" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="272">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="273" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="274/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="274">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="275" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="275">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="277/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="995136" size="12288" shape="192,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="97">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="276" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="277/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="277">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="278" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="278">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="280/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="1007424" size="3456" shape="192,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="103">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="279" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="280/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="280">
					<dim>1</dim>
					<dim>192</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="281" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="281">
					<dim>1</dim>
					<dim>192</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="282" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="283/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="283">
					<dim>1</dim>
					<dim>64</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="data_add_77467751" type="Const" version="opset1">
			<data offset="1010880" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="291/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="1011008" size="49152" shape="64,384,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="127">
					<dim>64</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="data_add_77387743" type="Const" version="opset1">
			<data offset="1060160" size="768" shape="1,384,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="data_add_77307735" type="Const" version="opset1">
			<data offset="1060928" size="768" shape="1,384,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="285/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="1061696" size="49152" shape="384,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="115">
					<dim>384</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="284" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>384</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="285/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="285">
					<dim>1</dim>
					<dim>384</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="286" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="286">
					<dim>1</dim>
					<dim>384</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="288/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="1110848" size="6912" shape="384,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="121">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="287" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="288/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="288">
					<dim>1</dim>
					<dim>384</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="289" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="289">
					<dim>1</dim>
					<dim>384</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="290" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="291/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="291">
					<dim>1</dim>
					<dim>64</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="292" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="292">
					<dim>1</dim>
					<dim>64</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="294/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="1117760" size="49152" shape="384,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="133">
					<dim>384</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="293" type="Convolution" version="opset1">
