<?xml version="1.0" ?>
<net name="saved_model" version="10">
	<layers>
		<layer id="0" name="normalized_input_image_tensor" type="Parameter" version="opset1">
			<data shape="1, 3, 192, 192" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="normalized_input_image_tensor:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Mul/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="0" size="2"/>
			<output>
				<port id="0" precision="FP16" names="Mul/y:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Mul:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Mul_1" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="2" size="2"/>
			<output>
				<port id="0" precision="FP16" names="Mul_1:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Sub" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Sub:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Conv2D/filter" type="Const" version="opset1">
			<data element_type="f16" shape="24, 3, 3, 3" offset="4" size="1296"/>
			<output>
				<port id="0" precision="FP16" names="Conv2D/filter:0">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Conv2D:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="FeatureExtractor/MobilenetV2/Conv/Relu6/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="1300" size="48"/>
			<output>
				<port id="0" precision="FP16" names="FeatureExtractor/MobilenetV2/Conv/Relu6/y:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="FeatureExtractor/MobilenetV2/Conv/Relu6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/Conv/Relu6:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="FeatureExtractor/MobilenetV2/Conv/Relu6_1" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="FeatureExtractor/MobilenetV2/Conv/Relu6_1:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="depthwise/filter_in" type="Const" version="opset1">
			<data element_type="f16" shape="24, 1, 1, 3, 3" offset="1348" size="432"/>
			<output>
				<port id="0" precision="FP16" names="depthwise/filter_in:0">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="depthwise:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="FeatureExtractor/MobilenetV2/expanded_conv/depthwise/Relu6/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="1780" size="48"/>
			<output>
				<port id="0" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv/depthwise/Relu6/y:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="FeatureExtractor/MobilenetV2/expanded_conv/depthwise/Relu6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv/depthwise/Relu6:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="FeatureExtractor/MobilenetV2/expanded_conv/depthwise/Relu6_1" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv/depthwise/Relu6_1:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv2D_1/filter" type="Const" version="opset1">
			<data element_type="f16" shape="16, 24, 1, 1" offset="1828" size="768"/>
			<output>
				<port id="0" precision="FP16" names="Conv2D_1/filter:0">
					<dim>16</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Conv2D_1" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Conv2D_1:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="FeatureExtractor/MobilenetV2/expanded_conv/project/add_fold/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="2596" size="32"/>
			<output>
				<port id="0" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv/project/add_fold/y:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="FeatureExtractor/MobilenetV2/expanded_conv/project/add_fold" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv/project/add_fold:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv2D_2/filter" type="Const" version="opset1">
			<data element_type="f16" shape="96, 16, 1, 1" offset="2628" size="3072"/>
			<output>
				<port id="0" precision="FP16" names="Conv2D_2/filter:0">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Conv2D_2" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Conv2D_2:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="FeatureExtractor/MobilenetV2/expanded_conv_1/expand/Relu6/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 96, 1, 1" offset="5700" size="192"/>
			<output>
				<port id="0" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_1/expand/Relu6/y:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="FeatureExtractor/MobilenetV2/expanded_conv_1/expand/Relu6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_1/expand/Relu6:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="FeatureExtractor/MobilenetV2/expanded_conv_1/expand/Relu6_1" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_1/expand/Relu6_1:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="depthwise_1/filter_in" type="Const" version="opset1">
			<data element_type="f16" shape="96, 1, 1, 3, 3" offset="5892" size="1728"/>
			<output>
				<port id="0" precision="FP16" names="depthwise_1/filter_in:0">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="depthwise_1" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="1, 1" dilations="1, 1" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="depthwise_1:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/Relu6/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 96, 1, 1" offset="7620" size="192"/>
			<output>
				<port id="0" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/Relu6/y:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/Relu6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/Relu6:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/Relu6_1" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/Relu6_1:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv2D_3/filter" type="Const" version="opset1">
			<data element_type="f16" shape="24, 96, 1, 1" offset="7812" size="4608"/>
			<output>
				<port id="0" precision="FP16" names="Conv2D_3/filter:0">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv2D_3" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Conv2D_3:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="FeatureExtractor/MobilenetV2/expanded_conv_1/project/add_fold/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="12420" size="48"/>
			<output>
				<port id="0" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_1/project/add_fold/y:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="FeatureExtractor/MobilenetV2/expanded_conv_1/project/add_fold" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_1/project/add_fold:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Conv2D_4/filter" type="Const" version="opset1">
			<data element_type="f16" shape="144, 24, 1, 1" offset="12468" size="6912"/>
			<output>
				<port id="0" precision="FP16" names="Conv2D_4/filter:0">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv2D_4" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Conv2D_4:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="FeatureExtractor/MobilenetV2/expanded_conv_2/expand/Relu6/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="19380" size="288"/>
			<output>
				<port id="0" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_2/expand/Relu6/y:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="FeatureExtractor/MobilenetV2/expanded_conv_2/expand/Relu6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_2/expand/Relu6:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="FeatureExtractor/MobilenetV2/expanded_conv_2/expand/Relu6_1" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_2/expand/Relu6_1:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="depthwise_2/filter_in" type="Const" version="opset1">
			<data element_type="f16" shape="144, 1, 1, 3, 3" offset="19668" size="2592"/>
			<output>
				<port id="0" precision="FP16" names="depthwise_2/filter_in:0">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="depthwise_2" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="depthwise_2:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/Relu6/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="22260" size="288"/>
			<output>
				<port id="0" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/Relu6/y:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/Relu6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/Relu6:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/Relu6_1" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/Relu6_1:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Conv2D_5/filter" type="Const" version="opset1">
			<data element_type="f16" shape="24, 144, 1, 1" offset="22548" size="6912"/>
			<output>
				<port id="0" precision="FP16" names="Conv2D_5/filter:0">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv2D_5" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Conv2D_5:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="FeatureExtractor/MobilenetV2/expanded_conv_2/project/add_fold/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="29460" size="48"/>
			<output>
				<port id="0" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_2/project/add_fold/y:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="FeatureExtractor/MobilenetV2/expanded_conv_2/project/add_fold" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_2/project/add_fold:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="FeatureExtractor/MobilenetV2/expanded_conv_2/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_2/add:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Conv2D_6/filter" type="Const" version="opset1">
			<data element_type="f16" shape="144, 24, 1, 1" offset="29508" size="6912"/>
			<output>
				<port id="0" precision="FP16" names="Conv2D_6/filter:0">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv2D_6" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Conv2D_6:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="FeatureExtractor/MobilenetV2/expanded_conv_3/expand/Relu6/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="36420" size="288"/>
			<output>
				<port id="0" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_3/expand/Relu6/y:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="FeatureExtractor/MobilenetV2/expanded_conv_3/expand/Relu6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_3/expand/Relu6:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="FeatureExtractor/MobilenetV2/expanded_conv_3/expand/Relu6_1" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_3/expand/Relu6_1:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="depthwise_3/filter_in" type="Const" version="opset1">
			<data element_type="f16" shape="144, 1, 1, 3, 3" offset="36708" size="2592"/>
			<output>
				<port id="0" precision="FP16" names="depthwise_3/filter_in:0">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="depthwise_3" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="1, 1" dilations="1, 1" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="depthwise_3:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/Relu6/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="39300" size="288"/>
			<output>
				<port id="0" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/Relu6/y:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/Relu6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/Relu6:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/Relu6_1" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/Relu6_1:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv2D_7/filter" type="Const" version="opset1">
			<data element_type="f16" shape="24, 144, 1, 1" offset="39588" size="6912"/>
			<output>
				<port id="0" precision="FP16" names="Conv2D_7/filter:0">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv2D_7" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Conv2D_7:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="FeatureExtractor/MobilenetV2/expanded_conv_3/project/add_fold/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="46500" size="48"/>
			<output>
				<port id="0" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_3/project/add_fold/y:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="FeatureExtractor/MobilenetV2/expanded_conv_3/project/add_fold" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_3/project/add_fold:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv2D_8/filter" type="Const" version="opset1">
			<data element_type="f16" shape="144, 24, 1, 1" offset="46548" size="6912"/>
			<output>
				<port id="0" precision="FP16" names="Conv2D_8/filter:0">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Conv2D_8" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Conv2D_8:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="FeatureExtractor/MobilenetV2/expanded_conv_4/expand/Relu6/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="53460" size="288"/>
			<output>
				<port id="0" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_4/expand/Relu6/y:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="FeatureExtractor/MobilenetV2/expanded_conv_4/expand/Relu6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_4/expand/Relu6:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="FeatureExtractor/MobilenetV2/expanded_conv_4/expand/Relu6_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_4/expand/Relu6_1:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="depthwise_4/filter_in" type="Const" version="opset1">
			<data element_type="f16" shape="144, 1, 1, 3, 3" offset="53748" size="2592"/>
			<output>
				<port id="0" precision="FP16" names="depthwise_4/filter_in:0">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="depthwise_4" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="depthwise_4:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/Relu6/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="56340" size="288"/>
			<output>
				<port id="0" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/Relu6/y:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/Relu6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/Relu6:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/Relu6_1" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/Relu6_1:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv2D_9/filter" type="Const" version="opset1">
			<data element_type="f16" shape="24, 144, 1, 1" offset="56628" size="6912"/>
			<output>
				<port id="0" precision="FP16" names="Conv2D_9/filter:0">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv2D_9" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Conv2D_9:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="FeatureExtractor/MobilenetV2/expanded_conv_4/project/add_fold/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="63540" size="48"/>
			<output>
				<port id="0" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_4/project/add_fold/y:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="FeatureExtractor/MobilenetV2/expanded_conv_4/project/add_fold" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_4/project/add_fold:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="FeatureExtractor/MobilenetV2/expanded_conv_4/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_4/add:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Conv2D_10/filter" type="Const" version="opset1">
			<data element_type="f16" shape="144, 24, 1, 1" offset="63588" size="6912"/>
			<output>
				<port id="0" precision="FP16" names="Conv2D_10/filter:0">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Conv2D_10" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Conv2D_10:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="FeatureExtractor/MobilenetV2/expanded_conv_5/expand/Relu6/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="70500" size="288"/>
			<output>
				<port id="0" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_5/expand/Relu6/y:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="FeatureExtractor/MobilenetV2/expanded_conv_5/expand/Relu6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_5/expand/Relu6:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="FeatureExtractor/MobilenetV2/expanded_conv_5/expand/Relu6_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_5/expand/Relu6_1:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="depthwise_5/filter_in" type="Const" version="opset1">
			<data element_type="f16" shape="144, 1, 1, 3, 3" offset="70788" size="2592"/>
			<output>
				<port id="0" precision="FP16" names="depthwise_5/filter_in:0">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="depthwise_5" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="depthwise_5:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/Relu6/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="73380" size="288"/>
			<output>
				<port id="0" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/Relu6/y:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/Relu6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/Relu6:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/Relu6_1" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/Relu6_1:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv2D_11/filter" type="Const" version="opset1">
			<data element_type="f16" shape="24, 144, 1, 1" offset="73668" size="6912"/>
			<output>
				<port id="0" precision="FP16" names="Conv2D_11/filter:0">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Conv2D_11" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Conv2D_11:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="FeatureExtractor/MobilenetV2/expanded_conv_5/project/add_fold/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="80580" size="48"/>
			<output>
				<port id="0" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_5/project/add_fold/y:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="FeatureExtractor/MobilenetV2/expanded_conv_5/project/add_fold" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_5/project/add_fold:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="FeatureExtractor/MobilenetV2/expanded_conv_5/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_5/add:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Conv2D_12/filter" type="Const" version="opset1">
			<data element_type="f16" shape="144, 24, 1, 1" offset="80628" size="6912"/>
			<output>
				<port id="0" precision="FP16" names="Conv2D_12/filter:0">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Conv2D_12" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Conv2D_12:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="FeatureExtractor/MobilenetV2/expanded_conv_6/expand/Relu6/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="87540" size="288"/>
			<output>
				<port id="0" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_6/expand/Relu6/y:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="FeatureExtractor/MobilenetV2/expanded_conv_6/expand/Relu6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_6/expand/Relu6:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="FeatureExtractor/MobilenetV2/expanded_conv_6/expand/Relu6_1" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="FeatureExtractor/MobilenetV2/expanded_conv_6/expand/Relu6_1:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="depthwise_6/filter_in" type="Const" version="opset1">
			<data element_type="f16" shape="144, 1, 1, 3, 3" offset="87828" size="2592"/>
			<output>
				<port id="0" precision="FP16" names="depthwise_6/filter_in:0">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="depthwise_6" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="1, 1" dilations="1, 1" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="depthwise_6:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>12</dim>
					<dim>12</dim>
